{
  "user_id": "127fa11a-442f-4180-b0c4-c5e3efacdea5",
  "topics": [
    {
      "id": "b132cf95-4b40-4ab7-88ec-8901d0787192",
      "subject_id": "literature",
      "name": "Oliver Twist",
      "description": "",
      "user_id": "127fa11a-442f-4180-b0c4-c5e3efacdea5",
      "created_at": "2025-08-02 04:06:16"
    },
    {
      "id": "cfbfc212-5d05-4452-bf29-9febcb4a61a4",
      "subject_id": "history",
      "name": "Mughals",
      "description": "",
      "user_id": "127fa11a-442f-4180-b0c4-c5e3efacdea5",
      "created_at": "2025-08-02 17:26:23"
    },
    {
      "id": "ac876845-5f63-48a4-9b63-ab1cb3880eb0",
      "subject_id": "history",
      "name": "Ancient Egypt",
      "description": "",
      "user_id": "127fa11a-442f-4180-b0c4-c5e3efacdea5",
      "created_at": "2025-08-02 21:00:41"
    }
  ],
  "notes": [
    {
      "id": "e48b5103-e9e8-47cd-83ee-080a930c41ea",
      "topic_id": "b132cf95-4b40-4ab7-88ec-8901d0787192",
      "content": "<p>OLIVER, BEING OFFERED ANOTHER PLACE,\nMAKES HIS FIRST ENTRY INTO PUBLIC LIFE\nIn great families, when an advantageous place cannot be obtained, either in possession, reversion, remainder, or expectancy, for the young man who is growing up, it is a very general custom to send him to sea. The board, in imitation of so wise and salutary an example, took counsel together on the expediency of shipping off Oliver Twist, in some small trading vessel bound to a good unhealthy port. This suggested itself as the very best thing that could possibly be done with him: the probability being, that the skipper would flog him to death, in a playful mood, some day after dinner, or would knock his brains out with an iron bar; both pastimes being, as is pretty generally known, very favourite and common recreations among gentleman of that class. The more the case presented itself to the board, in this point of view, the more manifold the advantages of the step appeared; so, they came to the conclusion that the only way of providing for Oliver effectually, was to send him to sea without delay.\n\nMr. Bumble had been dispatched to make various preliminary inquiries, with the view of finding out some captain or other who wanted a cabin-boy without any friends; and was returning to the workhouse to communicate the result of his mission; when he encountered at the gate, no less a person than Mr. Sowerberry, the parochial undertaker.\n\nMr. Sowerberry was a tall gaunt, large-jointed man, attired in a suit of threadbare black, with darned cotton stockings of the same colour, and shoes to answer. His features were not naturally intended to wear a smiling aspect, but he was in general rather given to professional jocosity. His step was elastic, and his face betokened inward pleasantry, as he advanced to Mr. Bumble, and shook him cordially by the hand.\n\n'I have taken the measure of the two women that died last night, Mr. Bumble,' said the undertaker.\n\n'You'll make your fortune, Mr. Sowerberry,' said the beadle, as he thrust his thumb and forefinger into the proffered snuff-box of the undertaker: which was an ingenious little model of a patent coffin. 'I say you'll make your fortune, Mr. Sowerberry,' repeated Mr. Bumble, tapping the undertaker on the shoulder, in a friendly manner, with his cane.\n\n'Think so?' said the undertaker in a tone which half admitted and half disputed the probability of the event. 'The prices allowed by the board are very small, Mr. Bumble.'\n\n'So are the coffins,' replied the beadle: with precisely as near an approach to a laugh as a great official ought to indulge in.\n\nMr. Sowerberry was much tickled at this: as of course he ought to be; and laughed a long time without cessation. 'Well, well, Mr. Bumble,' he said at length, 'there's no denying that, since the new system of feeding has come in, the coffins are something narrower and more shallow than they used to be; but we must have some profit, Mr. Bumble. Well-seasoned timber is an expensive article, sir; and all the iron handles come, by canal, from Birmingham.'\n\n'Well, well,' said Mr. Bumble, 'every trade has its drawbacks. A fair profit is, of course, allowable.'\n\n'Of course, of course,' replied the undertaker; 'and if I don't get a profit upon this or that particular article, why, I make it up in the long-run, you see—he! he! he!'\n\n'Just so,' said Mr. Bumble.\n\n'Though I must say,' continued the undertaker, resuming the current of observations which the beadle had interrupted: 'though I must say, Mr. Bumble, that I have to contend against one very great disadvantage: which is, that all the stout people go off the quickest. The people who have been better off, and have paid rates for many years, are the first to sink when they come into the house; and let me tell you, Mr. Bumble, that three or four inches over one's calculation makes a great hole in one's profits: especially when one has a family to provide for, sir.'\n\nAs Mr. Sowerberry said this, with the becoming indignation of an ill-used man; and as Mr. Bumble felt that it rather tended to convey a reflection on the honour of the parish; the latter gentleman thought it advisable to change the subject. Oliver Twist being uppermost in his mind, he made him his theme.\n\n'By the bye,' said Mr. Bumble, 'you don't know anybody who wants a boy, do you? A porochial 'prentis, who is at present a dead-weight; a millstone, as I may say, round the porochial throat? Liberal terms, Mr. Sowerberry, liberal terms?' As Mr. Bumble spoke, he raised his cane to the bill above him, and gave three distinct raps upon the words 'five pounds': which were printed thereon in Roman capitals of gigantic size.\n\n'Gadso!' said the undertaker: taking Mr. Bumble by the gilt-edged lappel of his official coat; 'that's just the very thing I wanted to speak to you about. You know—dear me, what a very elegant button this is, Mr. Bumble! I never noticed it before.'\n\n'Yes, I think it rather pretty,' said the beadle, glancing proudly downwards at the large brass buttons which embellished his coat. 'The die is the same as the porochial seal—the Good Samaritan healing the sick and bruised man. The board presented it to me on Newyear's morning, Mr. Sowerberry. I put it on, I remember, for the first time, to attend the inquest on that reduced tradesman, who died in a doorway at midnight.'\n\n'I recollect,' said the undertaker. 'The jury brought it in, \"Died from exposure to the cold, and want of the common necessaries of life,\" didn't they?'\n\nMr. Bumble nodded.\n\n'And they made it a special verdict, I think,' said the undertaker, 'by adding some words to the effect, that if the relieving officer had—'\n\n'Tush! Foolery!' interposed the beadle. 'If the board attended to all the nonsense that ignorant jurymen talk, they'd have enough to do.'\n\n'Very true,' said the undertaker; 'they would indeed.'\n\n'Juries,' said Mr. Bumble, grasping his cane tightly, as was his wont when working into a passion: 'juries is ineddicated, vulgar, grovelling wretches.'\n\n'So they are,' said the undertaker.\n\n'They haven't no more philosophy nor political economy about 'em than that,' said the beadle, snapping his fingers contemptuously.\n\n'No more they have,' acquiesced the undertaker.\n\n'I despise 'em,' said the beadle, growing very red in the face.\n\n'So do I,' rejoined the undertaker.\n\n'And I only wish we'd a jury of the independent sort, in the house for a week or two,' said the beadle; 'the rules and regulations of the board would soon bring their spirit down for 'em.'\n\n'Let 'em alone for that,' replied the undertaker. So saying, he smiled, approvingly: to calm the rising wrath of the indignant parish officer.\n\nMr Bumble lifted off his cocked hat; took a handkerchief from the inside of the crown; wiped from his forehead the perspiration which his rage had engendered; fixed the cocked hat on again; and, turning to the undertaker, said in a calmer voice:\n\n'Well; what about the boy?'\n\n'Oh!' replied the undertaker; 'why, you know, Mr. Bumble, I pay a good deal towards the poor's rates.'\n\n'Hem!' said Mr. Bumble. 'Well?'\n\n'Well,' replied the undertaker, 'I was thinking that if I pay so much towards 'em, I've a right to get as much out of 'em as I can, Mr. Bumble; and so—I think I'll take the boy myself.'\n\nMr. Bumble grasped the undertaker by the arm, and led him into the building. Mr. Sowerberry was closeted with the board for five minutes; and it was arranged that Oliver should go to him that evening 'upon liking'—a phrase which means, in the case of a parish apprentice, that if the master find, upon a short trial, that he can get enough work out of a boy without putting too much food into him, he shall have him for a term of years, to do what he likes with.\n\nWhen little Oliver was taken before 'the gentlemen' that evening; and informed that he was to go, that night, as general house-lad to a coffin-maker's; and that if he complained of his situation, or ever came back to the parish again, he would be sent to sea, there to be drowned, or knocked on the head, as the case might be, he evinced so little emotion, that they by common consent pronounced him a hardened young rascal, and ordered Mr. Bumble to remove him forthwith.\n\nNow, although it was very natural that the board, of all people in the world, should feel in a great state of virtuous astonishment and horror at the smallest tokens of want of feeling on the part of anybody, they were rather out, in this particular instance. The simple fact was, that Oliver, instead of possessing too little feeling, possessed rather too much; and was in a fair way of being reduced, for life, to a state of brutal stupidity and sullenness by the ill usage he had received. He heard the news of his destination, in perfect silence; and, having had his luggage put into his hand—which was not very difficult to carry, inasmuch as it was all comprised within the limits of a brown paper parcel, about half a foot square by three inches deep—he pulled his cap over his eyes; and once more attaching himself to Mr. Bumble's coat cuff, was led away by that dignitary to a new scene of suffering.\n\nFor some time, Mr. Bumble drew Oliver along, without notice or remark; for the beadle carried his head very erect, as a beadle always should: and, it being a windy day, little Oliver was completely enshrouded by the skirts of Mr. Bumble's coat as they blew open, and disclosed to great advantage his flapped waistcoat and drab plush knee-breeches. As they drew near to their destination, however, Mr. Bumble thought it expedient to look down, and see that the boy was in good order for inspection by his new master: which he accordingly did, with a fit and becoming air of gracious patronage.\n\n'Oliver!' said Mr. Bumble.\n\n'Yes, sir,' replied Oliver, in a low, tremulous voice.\n\n'Pull that cap off your eyes, and hold up your head, sir.'\n\nAlthough Oliver did as he was desired, at once; and passed the back of his unoccupied hand briskly across his eyes, he left a tear in them when he looked up at his conductor. As Mr. Bumble gazed sternly upon him, it rolled down his cheek. It was followed by another, and another. The child made a strong effort, but it was an unsuccessful one. Withdrawing his other hand from Mr. Bumble's he covered his face with both; and wept until the tears sprung out from between his chin and bony fingers.\n\n'Well!' exclaimed Mr. Bumble, stopping short, and darting at his little charge a look of intense malignity. 'Well! Of all the ungratefullest, and worst-disposed boys as ever I see, Oliver, you are the—'\n\n'No, no, sir,' sobbed Oliver, clinging to the hand which held the well-known cane; 'no, no, sir; I will be good indeed; indeed, indeed I will, sir! I am a very little boy, sir; and it is so—so—'\n\n'So what?' inquired Mr. Bumble in amazement.\n\n'So lonely, sir! So very lonely!' cried the child. 'Everybody hates me. Oh! sir, don't, don't pray be cross to me!' The child beat his hand upon his heart; and looked in his companion's face, with tears of real agony.\n\nMr. Bumble regarded Oliver's piteous and helpless look, with some astonishment, for a few seconds; hemmed three or four times in a husky manner; and after muttering something about 'that troublesome cough,' bade Oliver dry his eyes and be a good boy. Then once more taking his hand, he walked on with him in silence.\n\nThe undertaker, who had just put up the shutters of his shop, was making some entries in his day-book by the light of a most appropriate dismal candle, when Mr. Bumble entered.\n\n'Aha!' said the undertaker; looking up from the book, and pausing in the middle of a word; 'is that you, Bumble?'\n\n'No one else, Mr. Sowerberry,' replied the beadle. 'Here! I've brought the boy.' Oliver made a bow.\n\n'Oh! that's the boy, is it?' said the undertaker: raising the candle above his head, to get a better view of Oliver. 'Mrs. Sowerberry, will you have the goodness to come here a moment, my dear?'\n\nMrs. Sowerberry emerged from a little room behind the shop, and presented the form of a short, then, squeezed-up woman, with a vixenish countenance.\n\n'My dear,' said Mr. Sowerberry, deferentially, 'this is the boy from the workhouse that I told you of.' Oliver bowed again.\n\n'Dear me!' said the undertaker's wife, 'he's very small.'\n\n'Why, he is rather small,' replied Mr. Bumble: looking at Oliver as if it were his fault that he was no bigger; 'he is small. There's no denying it. But he'll grow, Mrs. Sowerberry—he'll grow.'\n\n'Ah! I dare say he will,' replied the lady pettishly, 'on our victuals and our drink. I see no saving in parish children, not I; for they always cost more to keep, than they're worth. However, men always think they know best. There! Get downstairs, little bag o' bones.' With this, the undertaker's wife opened a side door, and pushed Oliver down a steep flight of stairs into a stone cell, damp and dark: forming the ante-room to the coal-cellar, and denominated 'kitchen'; wherein sat a slatternly girl, in shoes down at heel, and blue worsted stockings very much out of repair.\n\n'Here, Charlotte,' said Mr. Sowerberry, who had followed Oliver down, 'give this boy some of the cold bits that were put by for Trip. He hasn't come home since the morning, so he may go without 'em. I dare say the boy isn't too dainty to eat 'em—are you, boy?'\n\nOliver, whose eyes had glistened at the mention of meat, and who was trembling with eagerness to devour it, replied in the negative; and a plateful of coarse broken victuals was set before him.\n\nI wish some well-fed philosopher, whose meat and drink turn to gall within him; whose blood is ice, whose heart is iron; could have seen Oliver Twist clutching at the dainty viands that the dog had neglected. I wish he could have witnessed the horrible avidity with which Oliver tore the bits asunder with all the ferocity of famine. There is only one thing I should like better; and that would be to see the Philosopher making the same sort of meal himself, with the same relish.\n\n'Well,' said the undertaker's wife, when Oliver had finished his supper: which she had regarded in silent horror, and with fearful auguries of his future appetite: 'have you done?'\n\nThere being nothing eatable within his reach, Oliver replied in the affirmative.\n\n'Then come with me,' said Mrs. Sowerberry: taking up a dim and dirty lamp, and leading the way upstairs; 'your bed's under the counter. You don't mind sleeping among the coffins, I suppose? But it doesn't much matter whether you do or don't, for you can't sleep anywhere else. Come; don't keep me here all night!'\n\nOliver lingered no longer, but meekly followed his new mistress.</p>",
      "file_name": "OLIVER TWIST CHAPTER 4.html",
      "word_count": 2559,
      "created_at": "2025-08-02 04:06:34"
    },
    {
      "id": "ae72ebce-c666-438a-8ab8-50c1082523b4",
      "topic_id": "cfbfc212-5d05-4452-bf29-9febcb4a61a4",
      "content": "1 www.visionias.in Vision IAS QUICK REVISION MODULE (UPSC PRELIMS 2024) ANCIENT & MEDIEVAL HISTORY ZAHIRUDDIN MUHAMMAD BABUR 1526–1530 1530–1540 & 1555-1556 NASIR- UD -DIN MUHAMMAD HUMAYUN THE GREAT MUGHALS (Six Major Rulers) 2 www.visionias.in Vision IAS S. NoName of the BattleParticipantsResult 1 First Battle of Panipat, 21 April 1526 Babur Vs. Ibrahim LodiBabur won with the help of strategic positioning of his forces and the effective use of artillery. 2 Battle of Khanwa, 1527 Babur Vs. Rana Sanga of Chittor, Mahmud Lodi, brother of Ibrahim Lodi, and Hasan Khan Mewati, ruler of Mewat Babur defeated Rana Sanga’s forces. The capture of forts at Gwalior and Dholpur which further strengthened Babur’s position. ABU'L-FATH JALAL-UD-DIN MUHAMMAD AKBAR 1556–1605 NUR-UD-DIN MUHAMMAD SALIM JAHANGIR 1605–1627 MUHAMMAD KHURRAM SHAH JAHAN SHAHAB-UD-DIN 1627-1658 MUHI-UD-DIN MUHAMMAD AURANGZEB 1658–1707 IMPORTANT BATTLES 1526-1556 3 www.visionias.in Vision IAS S. NoName of the BattleParticipantsResult 3 Battle of Chanderi, 1528 Babur Vs. Medini RaiBabur won. 4 Battle of Ghagra, 1529 Babur Vs. Sultan Ibrahim Lodi’s brother Mahmud Lodi and Sultan Nusrat Shah, son-in-law of Ibrahim Lodi Babur defeated the Afghans. But he died on his way from Agra to Lahore in 1530 5 Battle of Chausa (1539) HUMAYUN Vs. Sher ShahSher Shah won due to his superior political and military skills. 6 Battle of Kanauj (1540) HUMAYUN Vs. Sher ShahSher Shah won. Humayun became a prince without a kingdom. 7 Second Battle of Panipat, 1556 Akbar Vs. Hemu (the Hindu general of Adil Shah The Mughal forces won the war. AKBAR’S MILITARY CONQUEST Baz Bahadur, who was later made a mansabdar in Akbar’s court. Malwa1562 Gondwana region1564 Rani Durgavati And Narayan. Central India was annexed Mewar1567 From Rana Uday Singh. Gujarat 1573 From Muzaffar Shah Kabul 1581 From Mirza Hakim Khandesh 1591 From Raja Ali Khan ruler of Khandesh, accepted Mughul emperor's suzerainty and agreed to pay an annual tribute. 4 www.visionias.in Vision IAS IMPORTANT WARS/EVENTS UNDER JAHANGIR IMPORTANT WARS/EVENTS UNDER SHAH JAHAN • Prince Khusrau who staged a revolt with the blessings of Sikh Guru Arjun Dev (5 th Sikh Guru). • Prince Khusrau was defeated, captured and blinded, while Guru Arjun Dev was executed. Challenging Jahangir's ascension • Tamed the rebel Afghan Usman Khanin in Bengal. • Rana Udai Singh and his son Rana Pratap Singh of Mewar Jahangir after a military campaign led by his son Prince Khurram. Capturing Rebellious Provinces Berar 1596 From Chand Bibi Ahmednagar 1600 From Muzaffar Shah 1638 Shah Jahan annexed Kandahar, conquered by Akbar and lost by Jahangir Portugese 200 in number were driven out of Hugli area (Bengal) Consolidation of Deccan in Mughal Empire: Shah Jahan divided Deccan into four provinces: Ahmednagar with Daulatabad; Khandesh; Berar; and Telengana. The viceroyalty of the four provinces was conferred to Aurangzeb. Ahmednagar, which offered resistance to the Mughals, was annexed despite the efforts of Malik Ambar 5 www.visionias.in Vision IAS THE MUGHAL ADMINISTRATION A war of succession broke out between the four sons of Shah Jahan in which Aurangzeb won The Jat rebellion (1669), Mathura rose under the leadership of a local Zamindar Gokul. Mughal army pursued the Jats and the leader Gokul was captured and executed The Satnamis Haryana region(1672), the Satnamis — a sect comprising peasants, artisans and untouchables — rebelled against the mighty Mughal Empire The Sikhs rebelled against Aurangzeb. The Sikh (The Punjab) rebellion, 1670 This erupted due to the political intrigues of Ram Rai, a claimant for the position of Sikh Guru, against the incumbent Guru Tegh Bahadur. This finally ended with the execution of Guru Tegh Bahadur (9th Sikh Guru). Aurangzeb’s Deccan Policy, to contain: 1. growing influence of the Marathas 2. The rebellious attitude of the Shia kingdoms of Deccan like Golkonda and Bijapur 3. Curtail the rebellious activities of his son Akbar IMPORTANT WARS/EVENTS UNDER AURANGZEB Humayun & Babur focus was more on military matters. Did not concentrate on establishing a definite system Akbar Elaborate rules and regulations were placed to guide officers in charge of administration Established various offices with assigned functions Highly CentralisedPan India 6 www.visionias.in Vision IAS CENTRAL ADMINISTRATION PROVINCIAL ADMINISTRATION Akbar1580 • Empire was divided into 12 subas(later 3 were added total 15) • Suba> Sarkar> Parganas> Mahal Emperor • Divine origin of monarchy. • All officers in Mughal administration over their position in power to the emperor. Wazir/wakil • Enjoyed both military and civil powers till Humayun’s Reign. • Under Akbar Financial powers were transferred to diwan kul. Sadr-us-Sudur • Head of Ecclesiastical department. • Duty to protect laws of the Shariat. Qazi-ul quzzat • Administer Shariat law both in civil and criminal matter. • Head of judiciary (prior to Aurangzeb this office did not exist. Mir Bakhshi • Appointment of Mansabdars. • Supervision of Dagh (branding of horses) & Chehra (preparation of muster roll based on facial description). Diwan Kul (chief Diwan) • Supervise imperial treasury & check all accounts. Mir Saman/ Khan Saman • Officer in charge of royal karkhanas 7 www.visionias.in Vision IAS LOCAL ADMINISTRATION Shah Jahan • Added another administrative unit Chakla i.e cluster of Parganas. • Chakla> Pargana> Mahal Subadar/Sipah Salaror Nazim • Governor of a province. • Directly appointed by the emperor. • Tenure: 3 years Waqai navis & Waqai nigars • Part of the postal system. • Duty was to supply important reports directly to the emperor. Bakhshi • Performed same functions as performed by Mir Bakhshi but for provinces. Darogha- I Dak • Head of Imperial Postal System. Sawanih nigar • Supplied confidential reports to the emperor, part of the secret services Diwan • Head of revenue department. • Independent officer answerable to the Centre. • Roznamcha (daily register) maintained by him to enter amounts deposited in royal treasury. Sarkars > Pargana (tehsil)> Mauza (village) At level of Sarkar 2 important officers: Faujdar: Head of the sarkar, take care of law and order problems. Also help Amalguzar in matters of revenue collection. Amalguzar/Amil: Assess and supervise the revenue collection. Sends receipts and expenditure reports to provincial diwan. Thanedar: Was the head of thana where army was stationed. He was placed under fuajdar. 8 www.visionias.in Vision IAS Pargana Shiqqdar : executive officer of the paragana, assisted amils in revenue collection. Amil : Revenue collection at pargana level. Qanungos : Kept all records pertaining to land in his area. Take note of different crops in the pargana. Town, Fort and Port Administration Kotwal: Duty to safeguard life and property in towns. Maintain register of people entering and leaving towns. Qiladar: Officer incharge of forts. Generally a high ranking mansabdar. Mutasaddi: Governor of the port, directly appointed by the emperor. PARGANA ADMINISTRATION VILLAGE ADMINISTRATION THE MUGHAL ARMY Consists of • Cavalry Infantry Artillery Elephants Camels There was no navy but there was a flotilla of boats. Muqaddam/Mandal Village headman Patwari Took care of village revenue records. 9 www.visionias.in Vision IAS Administrative system of Mughals. The word mansab is of Arabic origin meaning rank or position. The system determines rank and status of a government official and military generals. Every civil and military officer was given a mansab, which determined their salaries & allowances The mansab were in multiples of 10. Highest Rank under Akbar was 10000 which was increased by him to 12000. Rank above 7000 was given to princes. Amir- I - Azam/Udma: > Rank 2500 Amir: Rank 500 to 2500 Mansabdar: < Rank 500 MANSABDARI SYSTEM Cavalry • Dagh system (branding of horses) was used to main an efficient and well-equipped force of cavalry. Dakhili • Soldiers directly employed by state and sent to high ranking mansabdars. Ahadi • A separate category of soldiers called gentlemen troopers, were allowed to keep 5 horses or more. • Could be appointed in army or can serve as a messenger. Artillery • Developed rapidly in India after Babur. • Consists of 1 heavy artillery i.e., siege guns and heavy guns on forts. • 2 light artilleries: narnal (mounted on man), gajanal (mounted on elephants) & shutrnal (mounted on camels) CLASSIFICATION OF MANSABDARS 10 www.visionias.in Vision IAS 1st class mansabdar: Number of Sawar = Number of zat 2nd class mansabdar: Number of Sawar = 1/2 Number of zat 3rd class mansabdar: Number of Sawar < 1/2 Number of zat Types of Jagirs Tankha non hereditary (transferable) Mashrut non hereditary Altamagha non hereditary Watan hereditary (non transferable) Rajputs entitled to this. Jagirs given in lieu of salary Given under certain conditions. Given to Zamindar or Rajas in their local dominion Given to Muslim Nobels in his places of birth or hometown SALARY AND PAYMENT SYSTEM • The system was designated by dual representation: 1 personal rank called zat. 2 Cavalry rank called sawar. • Sawar rank determined number of armed cavalry men that the masabar had to maintain for imperial army. Structure of Mansabdari System Paid in cash (naqdi) or assigning mansabdars with jagirs (land) and allowed to collect land revenue and all other taxes from the jagirs. The Jagirdari System was integral part of the Mansabdari system. 11 www.visionias.in Vision IAS Ghalla Bakshi/ bhaoii/ batai: Division of crop at threshing floor after the grain was extracted. • Introduced by Shah Jahan. • Salaries of mansabdars were put on the monthly scale i.e. 8 months, 6 months or even less. Month ratio or month- scale system • Introduced by Jahangir. • Selected nobels were allowed to maintan a large quota of soldiers without changing the zat rank Du-aspah sih-aspah CHANGES IN MANSABDARI SYSTEM SOCIO- ECONOMIC LIFE UNDER MUGHALS METHODS OF LAND REVENUE ASSESSMENT Mughal Land Revenue System: Known as mal and mal wajib Process of land revenue collection: Assessment called Tashkhis/ Jama Actual collection called hasil. It was done seprately for kharib and rabi crop After assessment the findings are written on documents called patta, qual or qualqarar. 12 www.visionias.in Vision IAS Revenue Farming or Ijara system Peasnats/ raiyat/ muzarian/asami Two kinds of peasants: 1. khud-kashta: residents of the village in which they held their lands. 2. pahi-kashta non-resident cultivators who belonged to some other village, but cultivated lands on a contractual basis Khet batai: Share decided before the harvesting of crops. Lang batai: crop was cut but assessment was done before threshing. Nigamama-i Munshi: best method as the peasant and the State shared the risk of farming equally. Kankut/ danabandi: System where the revenue demand was fixed after the grain yield was estimated. Zabti System: For each crop cash revenue was fixed known as dastur ul amal/ dastur. It was to be paid in cash.It was based on Sher Shah rai system. Adopted only in Delhi, Agra, Awadh, Lahore and Multan. • When peasants lacked the means to cultivate their land or cultivation was impossible due to a calamity, the lands were farmed out on ijarah to a third party known as revenue farmers. • Mughals disapproved of this system but yet it was comman in jagir lands. PEASANTS 13 www.visionias.in Vision IAS Wholesale trade carried out by seth/bohra Retail trade was carried out by beoparis/banik Banjaras specialised in trasporting goods. Sarraf/shroff specialised in changing, keeping or lending money. Hundi was letter of credit payable after certain time. TRADE Religious Ideas and Beliefs • Tawhid-i-ilahi/ Din-i-ilahi: • Syncretic religion propounded by Akbar in 1852. • The spirit and core elements were borrowed from Sufism. • Main elements from Islam, Hinduism & Zoroastrianism. • Some elements of Christianity, Buddhism and Jainism can also be found. • Shul-i-kul • Discussion with various religious leaders use to take place in ibadat khana. • Akbar got the idea of shul-i-kul or Universal peace from participating in these discussion. It was one of the important vision of governance. • Jahangir and Shah Jahan too followed this principle. TRAVELLERS DURING THE GREAT MUGHAL REIGN TravellerEmperorAbout/Observations/books Anthony Monserrate (1578-1582) Ralph Fitch (1585-1591) AkbarA merchant, 1st Englishman to travel through India and Southeast Asia. Described about village life in detail. AkbarPortuguese priest : 14 William Hawkins (1608-1611) JahangirEnglish Ambassador of King James I Sir Thomas Roe (1615-1619) JahangirEnglish Diplomat came to India seeking for a trade agreement with Mughals. Francisco Pelasaert (1620-1627) JahangirDutch merchant, author of “Jahangir’s India”. Pietro Della Valle (1622- 1633) Jahangir & Shah Jahan Italian music composer. Gave vivid description of Ahmedabad. Peter Mundy (1628-1634) Shah JahanBritish merchant. TravellerEmperorAbout/Observations/books Jean Baptiste Travernier (1640-1668) Shah Jahan & Aurangzeb French Gem merchant, travelled India 6 times. Francois Bernier (1656-1668) Shah Jahan & Aurangzeb French physician, political philosopher, closely associated with Dara Shukoh. Author of “Travels in the Mughal Empire”. Made adverse remarks on efficiency of Mughal army (no drills or discipline). Excessive oppression of peasantry. Gave an account of royal Karkhanas. Niccolao Manucci (1658-1687) Shah Jahan & Aurangzeb Venetian writer, stayed back in India did not return to his homeland. Author of “Storia de Mogor”, a book on Mughals. Jean De Thevenot (1666-1668) AurangzebFrench botanist and traveller. TravellerEmperorAbout/Observations/books Copyright © by Vision IAS All rights are reserved. No part of this document may be reproduced, stored in a retrieval system or transmitted in any form or by any means, electronic, mechanical, photocopying, recording or otherwise, without prior permission of Vision IAS. Copyright © by Vision IAS All rights are reserved. No part of this document may be reproduced, stored in a retrieval system or transmitted in any form or by any means, electronic, mechanical, photocopying, recording or otherwise, without prior permission of Vision IAS.",
      "file_name": "9c61c-the-great-mughals.pdf",
      "word_count": 2207,
      "created_at": "2025-08-02 17:26:43"
    }
  ],
  "questions": [
    {
      "id": "a966511b-485e-4784-bbfb-baa660c1c070",
      "topic_id": "b132cf95-4b40-4ab7-88ec-8901d0787192",
      "question": "What is the board's initial plan for Oliver Twist when they consider his future?",
      "answer": "To ship him off to sea",
      "type": "multiple_choice",
      "options": "[\"To send him to a wealthy family\",\"To ship him off to sea\",\"To place him in an apprenticeship\",\"To adopt him themselves\"]",
      "correct_index": 1,
      "explanation": "The board concludes that the best course of action for Oliver is to send him to sea, considering it a way to provide for him effectively.",
      "created_at": "2025-08-02 04:07:03",
      "note_id": null
    },
    {
      "id": "64aefb38-9438-4bfd-87d7-3d1f482925f6",
      "topic_id": "b132cf95-4b40-4ab7-88ec-8901d0787192",
      "question": "How does the board view the potential treatment of Oliver by the ship's captain?",
      "answer": "They think he might be treated poorly",
      "type": "multiple_choice",
      "options": "[\"They believe he will be well cared for\",\"They think he might be treated poorly\",\"They are unsure about his treatment\",\"They expect him to be promoted quickly\"]",
      "correct_index": 1,
      "explanation": "The board speculates that the captain might harm Oliver, indicating a grim outlook on his potential treatment aboard the ship.",
      "created_at": "2025-08-02 04:07:03",
      "note_id": null
    },
    {
      "id": "3318b617-062b-4324-9c6f-1c36f3c78d70",
      "topic_id": "b132cf95-4b40-4ab7-88ec-8901d0787192",
      "question": "What does Mr. Sowerberry's appearance suggest about his character?",
      "answer": "He is professional and jovial",
      "type": "multiple_choice",
      "options": "[\"He is wealthy and carefree\",\"He is poor and miserable\",\"He is professional and jovial\",\"He is a kind-hearted individual\"]",
      "correct_index": 2,
      "explanation": "Mr. Sowerberry's attire is threadbare, but he is described as having an elastic step and a face that suggests inward pleasantry, indicating a professional jocosity.",
      "created_at": "2025-08-02 04:07:03",
      "note_id": null
    },
    {
      "id": "8f311883-ffcb-47d1-bf6d-3ae46495a32b",
      "topic_id": "b132cf95-4b40-4ab7-88ec-8901d0787192",
      "question": "What does Mr. Bumble's mission involve?",
      "answer": "Looking for a cabin-boy for a ship",
      "type": "multiple_choice",
      "options": "[\"Finding a new home for Oliver\",\"Looking for a cabin-boy for a ship\",\"Planning a funeral for the deceased women\",\"Recruiting workers for the workhouse\"]",
      "correct_index": 1,
      "explanation": "Mr. Bumble is tasked with finding a captain who needs a cabin-boy, specifically one who has no friends, which aligns with the board's plan for Oliver.",
      "created_at": "2025-08-02 04:07:03",
      "note_id": null
    },
    {
      "id": "2f14523d-abbf-4820-b90d-46ebc029e7c8",
      "topic_id": "b132cf95-4b40-4ab7-88ec-8901d0787192",
      "question": "What does the phrase \"professional jocosity\" imply about Mr. Sowerberry's demeanor?",
      "answer": "He often jokes and is lighthearted",
      "type": "multiple_choice",
      "options": "[\"He is serious and somber\",\"He often jokes and is lighthearted\",\"He is indifferent and uncaring\",\"He is angry and frustrated\"]",
      "correct_index": 1,
      "explanation": "The term \"professional jocosity\" suggests that Mr. Sowerberry has a tendency to joke and maintain a lighthearted demeanor, despite the serious nature of his profession as an undertaker.",
      "created_at": "2025-08-02 04:07:03",
      "note_id": null
    }
  ],
  "practice_sessions": [],
  "user_answers": [],
  "user_usage": [
    {
      "id": 1,
      "user_id": "127fa11a-442f-4180-b0c4-c5e3efacdea5",
      "month_year": "2025-08",
      "questions_used": 13,
      "storage_used": 15187784,
      "topics_created": 0,
      "created_at": "2025-08-02 04:05:55",
      "updated_at": "2025-08-02 17:29:46"
    }
  ]
}